{
  "name": "Debunking Mughals celebrated Deepawali",
  "id" : "debunking-ancient-Indians-did-not-use-crackers",
  "type": "conversation",
  "references" : [
    {
      "type" : "conversation",
      "id" : "Roopa-vs-True-Indology", 
      "highlightedCard" : 0,
      "storyPreviewCards" : ["3"],
      "conversationPreviewCards" : ["1","3","9"]
    }
  ],
  "cards": [
   {
    "id": 1,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"Here is a painting from Rajasthan depicting celebration of Dīpāvali by Krishna and Radha using firecrackers. From Rajasthan school of art (c. 1700 CE) दीपज्योतिः परंब्रह्म दीपज्योतिर्जनार्दनः। दीपो हरतु मे पापं दीपज्योतिर्नमोऽस्तु ते॥ आप सभी को शुभ धनत्रयोदशी तथा शुभ दीपावलि!",
    "imageIds" : ["krishna_radha.jpg"]
   },
   {
    "id": 2,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "NewsPlanet.org",
    "actor_id": "NewsPlanet_Org",
    "message":"The firecrackers and fireworks were invented by the Chinese and they were brought to Indian subcontinent by the mighty Mughals.",
    "contextNote" : "This Claim is debunked. Remember this account claims to be a news portal - https://www.newsplanet.org/ <img src=\"/assets/IMAGES/Annotation 2020-11-22 134843.jpg\" class=\"img-fluid\">"
   },
   {
    "id": 3,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"Shut up! Ancient Indians used Gunpowder long BEFORE Mughal invaders were even BORN. Ancient Indians used <span class=\"redUnderline\">Saltpetre (Agnichurna)</span>, the major constituent of gunpowder, to make firecrackers (ulkah) on Diwali. \"Gunpowder originated in Ancient India\"- Indologist Dr. Gustav Oppert",
    "imageIds" : ["diwali000.jpg"]
   },
   {
    "id": 4,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"While it is true that use of Gunpowder in matchlocks proliferated in the middle ages Ancient Indians used Saltpetre (Agnichurna) in mining and warfare. It was already mentioned by Kautilya in Arthashastra as a weapon of war (4th century BC) long BEFORE Mughals were born",
    "imageIds" : ["saltpetreInAncientIndia.jpg"]
  },
   {
    "id": 5,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"From the time of Arthashastra down into the Medieval ages,North West Indians continued to use gunpowder in warfare. A Chinese text dating back 7th century CE attests to the use of Gun Powder in North West India. Snippet from \"Military Transition in Early Modern Asia,1400- 1750\"",
    "imageIds" : ["saltpetreInAncientIndia02.jpg"]
   },
   {
    "id": 6,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"According to the old tradition of Muslim Arabs themselves They learnt the use of Gunpowder (barud) from Indians. They received their earliest Gunpowder supplies from India",
    "imageIds" : ["saltpetreInAncientIndia03.jpg"]
   },
   {
    "id": 7,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"When Timur, the ancestor Abbu of Mughals invaded India in 1398 CE, Indian troops shot his army with rockets and fireworks. It shocked his troops and they were beaten in the initial engagement",
    "imageIds" : ["saltpetreInAncientIndia04.jpg"]
   },
   {
    "id": 8,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"Even in 13th century, a Mongol foreign ambassador to India was greeted with 3000 celebratory firecars which are much reminiscent of Indian firework celebrations during Dipavali and Kartika Purnima",
    "imageIds" : ["saltpetreInAncientIndia05.jpg"]
   },
   {
    "id": 9,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "NewsPlanet.org",
    "actor_id": "NewsPlanet_Org",
    "message":"Hello True Fraudology, you may continue to blabber any filth but the fact remains that you must thank the Chinese and a Muslim named ABDUR RAZZAQ every time you light a phooljhari. And also Yaum e Chiraaga Mubarak to you. #Diwali",
    "imageIds" : ["diwali001.jpg","diwali002.jpg"],
    "contextNote" : "Yaum e Chiraaga Mubarak - is a sarcastic jibe insinuating that Diwali is a Mughal celebration. Sasi Tharoor too tried to do the same with a photoshopped image recently."
   },
   {
    "id": 10,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"Filthy Madarassachap, Do they not teach you basic comprehension in Madrasa? Your screenshot says Abdur Razzaq SAW fireworks in India. NOT that he BROUGHT fireworks. He lived BEFORE Mughals=> fireworks existed in India BEFORE Mughals. Your screenshot disproves you. Idi0t!"
   },
   {
    "id": 11,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"Vaisampayana, the narrator of Mahabharata, describes the manufacture of smoke balls by ancient Indians using Gunpowder. Atharvanarahasya mentions the use of <span class=\"redUnderline\"> charcoal, sulphur and saltpetre </span> to make fireworks,which are the same ingredients used even today to manufacture Gunpowder",
    "imageIds" : ["diwali003.jpg"]
  },
  {
    "id": 12,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"Remarkable sculptures from Hoysaleswara Temple (Halebidu, Karnataka. built c.12th century) show warriors using rockets (fire arrows). Arrows were tipped with Gunpowder / flammable combustibles. They were known as Agnibanas and used together on a launching pad in wars",
    "imageIds" : ["diwali004.jpg"]
  },
  {
    "id": 13,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"A sculpture from Halebidu (12th century) depicting rocket warfare in Ancient India. Notice the launching pad that is holding the missiles/combustible arrows. Mughals brought Gunpowder to India? Yeah right! ",
    "imageIds" : ["diwali005.jpg"]
  },
  {
    "id": 14,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "Vinod Unny",
    "actor_id": 1004,
    "message":"Whoa. That looks like a modern MLRS (Multi Launch Rocket System) used in most artilleries today!"
  },
  {
    "id": 15,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"While ancient Indians did use Gunpowder, what they did not have was a projecting weapon like a matchlock which could be integrated with the fire. They simply used to tip their arrows with Gunpowder and shoot at the enemy."
  },
  {
    "id": 16,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "Sanjeev Sanyal",
    "actor_id": 1005,
    "message":"Well this comes as a surprise for many of us who have been taught at schools that Tipu Sultan used Rockets in India for the first time & Chinese are pioneers in Pyrotechnics. Thanks @TIinExile fr opening our eyes. Thanks to that ignorant chap who triggered you to write these!"
   },
   {
    "id": 17,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "dhanawat_jatin",
    "actor_id": 0,
    "message":"Puts The Entire History of Weaponry on A Different Perspective ......"
   },
   {
    "id": 18,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "Nagarajan K",
    "actor_id": 0,
    "message":" Wow! Even this aspect of Indian history in school text books needs to be corrected. So much work to be done! Thanks to @TIinExile we come to know of these facts!"
   },
   {
    "id": 19,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "bloodspoon",
    "actor_id": 1006,
    "message":"Truly amazing facts... I am shocked why these things we don’t know. Thanks @TIinExile for bringing this facts. We will be indebted to you"
   },
   {
    "id": 20,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "Rajesh Kenam",
    "actor_id": 1007,
    "message":"Wow...What a Great thread. Get enlightened. Want to know about fire crackers and gunpowder used in Ancient Bharath, much much before Mughals came, as falsely claimed. It’s burnol 🔥🔥 moment for fakesters. Thank You @TIinExile 🙏. "
   }
  ]
 }