{
  "name": "Roopa blocks TrueIndology",
  "id" : "Roopa-blocks-TrueIndology",
  "type": "conversation",
  "references" : [
    {
      "type" : "story",
      "id" : "how-True-Indology-got-blocked-in-twitter", 
      "highlightedCard" : 0,
      "storyPreviewCards" : ["1","3"],
      "conversationPreviewCards" : ["1","3","9"]
    }
  ],
  "cards": [
   {
    "id": 1,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "D Roopa IPS",
    "actor_id": 1002,
    "message":".@TIinExile, \n ur follower trolls who are nameless,faceless ask me if I'm an expert on Hinduism. \n U r giving so much gyaan(which is incorrect many times) ,why don't u tell, R u an expert? \n What expertise u have? Y r u faceless/ nameless. A Don troll like u is afraid to put identity?"
   },
   {
    "id": 2,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"Madam,why do you want my pictures? what is your interest? It is my private information. Why do you want to infringe upon my privacy? I generally don't share my pictures with strangers unless one proposes a matrimonial prospect."
   },
   {
    "id": 3,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"Since I believe that is not the case, I do not know why you would want my private details. Twitter isn't any sarkari bereaucrat's baap ki jaagir. Twitter allows me my privacy. I will reveal just what I want. Who are you to tell me otherwise."
   },
   {
    "id": 4,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"It is funny that you call me a 'Don troll' when I have been respectful throughout the entire conversation. Not once have I made a single personal attack. You on the other hand have been issuing veiled threats like a street bully"
   },
   {
    "id": 5,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"It is surprising that in a country with 1.3 billion population, civil servants have all the time in the world to threaten and bully citizens online. While genuine grievances beg for attention. This is not the first time that I have been threatened by a civil servant"
   },
   {
    "id": 6,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "D Roopa IPS",
    "actor_id": 1002,
    "message":"Crying victim on some imaginary bullying. U with ur faceless/nameless trolls will troll with all abusive words& lying on top of it. Chori upar se seena jori,wah! There r many on other hand who've come up with facts how u n ur follower-trolls troll them. <span class=\"redUnderline\">Ur time's up</span>"
   },
   {
    "id": 7,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "D Roopa IPS",
    "actor_id": 1002,
    "message":".@TIinExile @theskindoctor13 &likes,u won't follow ban order of elected governments; u will not respect decision of quasi-judicial body NGT; U won't listen to someone like Dr Swamy(who said avoid crackers),who fought in court for Ram temple,Ram abt whom Dipavali is. But u troll?!"
   },
   {
    "id": 8,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "D Roopa IPS",
    "actor_id": 1002,
    "message":"And bcoz u have no respect for laws,rules of Govt,Court decisions &quasi judicial bodies &engage in continuous trolling with ur followers,misleading people with false knowledge, it will be wrong if I engage with trollers like u. Hence I'm blocking u .@TIinExile.@theskindoctor13"
   },
   {
    "id": 9,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "Venkat Sudheendra",
    "actor_id": 1003,
    "message":"Ma'am Dr. @Swamy39 said to avoid Crackers due to pollution ,he dint say don't burst crackers or crackers were from 15th century (as you mentioned) . @vsclekhaIAS ma'am, please intervene as Dr.Swamy is dragged here by @D_Roopa_IPS. Cc @rvaidya2000 @pGurus1"
   },
   {
    "id": 10,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "Venkat Sudheendra",
    "actor_id": 1003,
    "message":"@TIinExile As a person who admires your knowledge, I feel this could have been avoided...you could have been a little Polite to her and avoided usage of words like \"having 0 knowledge \". That hurt her a lot."
   },
   {
    "id": 11,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"@venzq She called me a Don, troll, faceless coward and a lot of other things. And I am the one who should care for her \"sentiments\"?"
   },
   {
    "id": 12,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "Venkat Sudheendra",
    "actor_id": 1003,
    "message":"I agree, it was too harsh on your side too but just check who started with \"having 0 knowledge and please don't embarrass yourself \" comment. Later on she started with all that which you said. Any woman would be hurt by that and she was not an enemy to the Hindus either."
   },
   {
    "id": 13,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"@venzq Oh so because I said her knowledge about crackers was lacking, An IPS officer on duty gets the license to threaten me directly saying \"your time is up\". Right?",
    "contextNote" : "By this time True Indology gets blocked from Twitter with no explanation"
   }
  ]
 }