{
  "name": "Roopa-vs-True-Indology",
  "id" : "Roopa-blocks-TrueIndology",
  "type": "conversation",
  "references" : [
    {
      "type" : "story",
      "id" : "how-True-Indology-got-blocked-in-twitter",
      "highlightedCard" : 0,
      "storyPreviewCards" : ["1","4"],
      "conversationPreviewCards" : ["1","3","4","5","8","9","100","110","110_1","209_5"]
    }
  ],
  "cards": [
   {
    "id": 1,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "D Roopa IPS",
    "actor_id": 1002,
    "message":"My contemplative piece on crackers, the govt ban and people's behaviour",
    "imageIds" : ["Roopa_FB_POST.jpg"],
    "contextNote" : "This is a screenshot from her FB post"
   },
   {
    "id": 2,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "Kanimozhi",
    "actor_id": "kanimozhi",
    "message":"Dear @MNageswarRaoIPS except for special case is <span class=\"redUnderline\"> Anti Hindu </span> mindset is mandatory for posting & promotion in IAS & IPS ? @D_Roopa_IPS",
    "contextNote" : "to which a user replied"
   },
   {
    "id": 3,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "D Roopa IPS",
    "actor_id": 1002,
    "message":"U should read my piece till last word. There's <span class=\"redUnderline\"> nothing Hindu about crackers</span>. Deepawali is more of lights sans crackers. <span class=\"redUnderline\">Crackers were never mentioned in epics or puranas</span>. It is something added to festival few centuries ago.Sati abolition,widow marriage were also resisted btw.",
    "contextNote" : ""
   },
   {
    "id": 4,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"Madam, you have ZERO knowledge about this. Stop embarrassing yourself. You say Fireworks are not mentioned in our Epics/Puranas. Have you read <span class=\"redUnderline\"> Ananda Ramayana </span>? It clearly mentions fireworks during Lord Rama's wedding BTW- Is your secular IPS service mentioned in our scriptures?",
    "contextNote" : "View further to see how True Indology proves IPS officer's statement wrong by <br/>a.) giving historic references and proofs from other Hindu texts too <br/>b.) and question her hypocrisy of not asking for scriptural references for Christmas or Eid celebrations"
   },
   {
    "id": 5,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"For references to firecrackers in Arthashastra, Shukraniti and Atharvanarahasya, check this thread. IPS officers are the consequence of the Marxist education. With some noted exceptions, the bureaucracy is a very integral part of the Marxist secular state",
    "stack" :{
      "folder"      : "Deepawali",
      "convFileId"  : "debunking-ancient-Indians-did-not-use-crackers"
    }
   },
   {
    "id": 6,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "D Roopa IPS",
    "actor_id": 1002,
    "message":"Glad. But Ananda Ramayan itself was a collection that was written later, around 15th century. Yes, by then whatever practices were there at that time, including crackers will find mention."
   },
   {
    "id": 7,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"You say Fireworks not part of Indian culture because they allegedly belong to 15th century. For the sake of argument, lemme accept it. There were NO MUGHALS in 15th century. Do you dare not be a hypocrite & accept that by the same logic Mughals also not part of Indian culture?"
   },
   {
    "id": 12,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "D Roopa IPS",
    "actor_id": 1002,
    "message":"@TIinexile Thanks for accepting, even if for sake of argument. When I say there's ban in crackers,some said it's anti-hindu. I said,it's a social practice,not found originally in epics. We have given up on various social practices tht were not conducive. Y resist crackers is all my question"
   },
   {
    "id": 14,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"@D_Roopa_IPS Madam, don't beat around the bush with nonsense. Give a direct answer to my question! My question was very SIMPLE. Are Mughals part of Indian culture? YES or NO. It is a very simple question and the answer is even simpler. Answer the question directly if you ever can.",
    "imageIds" : [],
    "contextNote" : "",
    "stack" :null
   },
   {
    "id": 8,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "D Roopa IPS",
    "actor_id": 1002,
    "message":"@TIinExile pls show one sloka/couplet from mool Ramayan by Valmiki or even Mahabharat,or any ancient scripture tht crackers were in use at that time. If u show, I will apologise. Else, u apologise for saying I have zero knowledge."
   },
   {
    "id": 9,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"Done. उल्काहस्ता नराः कुर्युः पितॄणां मार्गदर्शनम्। नरकस्थास्तु ये प्रेतास्ते मार्गं तु व्रतात्सदा ।। - Skanda Purana. Skanda Purana is largest of the 18 Mahapuranas and one of the most important scriptures . No Hindu can cancel Skanda Purana . Only remains for you to apologise "
   },
   {
    "id": 120,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "D Roopa IPS",
    "actor_id": 1002,
    "message":"Ulka hastaa...ulka, ordinarily means meteor. But it also means flame. With flame /torch in hand. That doesn't even remotely mean crackers. Good try, though dear."
   },
   {
    "id": 130,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "rajSharma",
    "actor_id": "rajSharma",
    "message":"WRONG!! उल्का also means fire phenomenon in the sky. Anyways do you wanna say Hindus use to send meteors in the sky? 😂😂😂 Good Try Roopa ji. Joke Accha Maarte ho aap.",
    "imageIds" : ["ulka.jpg"]
   },
   {
    "id": 100,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"This verse is from Vaiṣṇava-khaṇḍa of Skanda Purāṇa. It describes rites to be performed on Dīpāvalī. It says that on the night of Chaturdashi, we need to show the path to the departed Pitrs by holding fireworks in our hands. English Translation of the Verse by GV Tagare",
    "imageIds" : ["skandhaPurana_01.jpg"]
   },
   {
    "id": 110,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"Analysing such verses, professor of Sanskrit and historian Dr. GV Raghavan concludes that crackers have been a part of Dipavali celebrations since earliest times. He says that their religious purpose was to light the path of the departed pitrs.",
    "imageIds" : ["skandhaPurana_02.jpg"]
   },
   {
    "id": "110_1",
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"@D_Roopa_IPS I answered your question. Now a question for you. Show a single verse from Valmiki Ramayana or Vyasa Mahabharata that mentions Dipavali. Once I have your verse, I will definitely show you crackers in that very verse",
    "imageIds" : ["skandhaPurana_02.jpg"]
   },
   {
    "id": 200,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "Grand old party INC @GrowthPer",
    "actor_id": "grandOldPartyINC",
    "message":"Dude that fireworks is not Crackers..You have been spreading fake news..forget purana..we do this by puting fire into jute sticks..they dont cause noise..",
    "imageIds" : []
   },
   {
    "id": 201,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "Ramanathan",
    "actor_id": "ramanathan",
    "message":"WTF, Do You know what is Panai Olai Vedi? It is still in use in TN where we put some naturally found chemicals in Palm leaves and Jute sticks and would burst it. It is mentioned 1000 Year back in Sri Bhashya written by Ramanujacharya.",
    "imageIds" : []
   },
   {
    "id": 202,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "Ramanathan",
    "actor_id": "ramanathan",
    "message":"ome more proof, still now in Srirangam temple the same mixture of Panai Olai Vedi prescribed by Ramanuja is used. It is now taken a modern form called as <a href='https://youtu.be/WfbEKLfLhWE'>Naattu Vedi</a>.",
    "imageIds" : []
   },
   {
    "id": 203,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"Some people are saying that Ulka(dana) does not mean today's modern crackers. Here is how their objection is not valid: Even if I accept for the same of argument that Ulka does not mean today's modern crackers, it ends up directly proving my point. Let me tell you how.",
    "imageIds" : []
   },
   {
    "id": 204,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"If you come across the kind of crackers that were available in the market even in 1980, you would be very surprised. They were NOTHING fancy like today's crackers. Many of them were quite primitive. Most people of India were poor and they used such basic crackers",
    "imageIds" : []
   },
   {
    "id": 205,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"They still served two basic purposes for which they were used 1) Made noise 2) Illuminated the sky Nobody bothered about alleged \"pollution\" that could have been an inadvertent consequence. Obviously, Crackers used in ancient India were different from today's modern crackers.",
    "imageIds" : []
   },
   {
    "id": 206,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"Crackers used in Ancient India were different from today's modern crackers. Just like chairs used in ancient India were different from today's modern chairs. Does that mean Chairs are not a part of Indian history? Almost everything used today is different from its predecessors.",
    "imageIds" : []
   },
   {
    "id": 207,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"If one goes by this logic, one could as well conclude that Ancient India had NOTHING in our culture because everything today is different from its yesteryear's predecessors. What is relevant is that the concept existed. And the concept was quite simple.",
    "imageIds" : []
   },
   {
    "id": 208,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"The concept was to use a combustible substance on the night of Dipavali to make a lot of noise, illuminate the sky and show the path to our departed ancestors. This is mentioned in the Skanda Purana itself & is true irrespective of whether or not Ulka means modern fire crackers.",
    "imageIds" : []
   },
   {
    "id": 209,
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"What does it all show? With advancement of technology, everything changes. But the basic concept of using combustibles to make noise and illuminate the sky on the day of Dipavali existed since ancient times. This was not a foreign import or 16th century concept.",
    "imageIds" : []
   },
   {
    "id": "209_2",
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"@D_Roopa_IPS You want to ban crackers during Diwali because they are not mentioned in Valmiki Ramayana. You rejected even Skanda Purana as inauthentic. Loudspeakers for Azaan is a 20th century concept. Not mentioned in ANY Isl&alpha;mic scripture. When are you banning Azaan Loudpseakers?",
    "imageIds" : []
   },
   {
    "id": "209_3",
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"FYI. When loudspeakers were first used in 20th century, several Prominent Isl&alpha;mic scholars issued fatwas against using it",
    "imageIds" : ["loudSpeakers.jpg"]
   },
   {
    "id": "209_4",
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"It is NOWHERE in Quran that animals have to be sacrificed on Bakrid. This injunction comes from \"later texts\". Using the same scriptural test to which you subject Hindus, When are you banning animal sacrifice in Bakrid? Or are these 'core religious based bans' only for Hindus?",
    "imageIds" : []
   },
   {
    "id": "209_5",
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"Madam, You want to ban crackers on Diwali because they are not mentioned in Valmiki Ramayana. Christmas is NOT EVEN MENTIONED in the Bible! Using your \"core-religious-text\" banning argument, when are you banning it? Or are these scriptural tests and bans only for Hindus?",
    "imageIds" : []
   },
   {
    "id": "209_6",
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "Weekender @Weekender_Dev",
    "actor_id": "weekender",
    "message":"Who says Christmas is not mentioned in Bible ? 🤣🤣🤣 Are you a total idiot ?",
    "imageIds" : []
   },
   {
    "id": "209_7",
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"Okay, Genius. Now show me the word \"Christmas\" in the Bible. Give out the verse number. Let us see what you have got. ",
    "imageIds" : []
   },
   {
    "id": "209_8",
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"This 15th century date for Ananda Ramayana has been given out by some indologists. In Hinduism, date does not determine validity. What does is the acceptance of texts among Sampradayas . Ananda Ramayana easily fulfills such tests and is accepted by most",
    "imageIds" : []
   },
   {
    "id": "209_9",
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"\"This practice is not old enough, ban it\" is Abrahamic. This is not really how Indians operate. Using the same yardstick, what about the constitution? How old is the constitution? Can the constitution be rejected on these grounds? If not, then how do we reject Ananda Ramayana?",
    "imageIds" : []
   },
   {
    "id": "209_10",
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "M. Nageswara Rao IPS",
    "actor_id": "NageswaraRaoIPS",
    "message":"As the issue has been deliberated adequately, it may not serve any purpose to prolong it further. May I therefore appeal to @TIinExile @D_Roopa_IPS & all others to call it a day and close the discussion. Thank you in anticipation.",
    "imageIds" : []
   },
   {
    "id": "209_11",
    "type": "card",
    "date": "2017-08-18T08:38:43",
    "actor": "True Indology",
    "actor_id": 1001,
    "message":"Madam @D_Roopa_IPS, I have said all I wanted to. I have nothing more to say. You and the readers are free to read my argument and judge the merits or lack thereof. No hard feelings and thank you for the discussion",
    "imageIds" : []
   }
  ]
 }